<?php 
/*
1. Проблема: 2 программиста работали на одним проектом. Первый писал код для управления плеером, второй - управления врага. При объединении проекта оказалось, что они оба назвали свои классы одинаково "Controller". Решите проблему с помощью namespace.
Создайте два пространства имен (Player и Enemy) содержащие одинаковый класс Controller.

2. Проблема: Программист написал фреймворк (готовый код для других прогеров) . Классы называл по смыслу: Controller, Game, Assets (т.е. очень популярные). Как ему решить проблему конфликта имен, чтобы людям было удобно пользоваться его фреймворком (писать собственные классы, подключать другие фреймворки)? Решите проблему с помощью namespace.
*/
 ?>